benchmarks/definitive_results/background/llama-2-13b/_8_/log_15794660.out
WARNING 02-18 17:06:57 _custom_ops.py:19] Failed to import from vllm._C with ModuleNotFoundError("No module named 'vllm._C'")
Namespace(backend='openai', host='localhost', port=28499, endpoint='/v1/completions', dataset=None, dataset_name='sharegpt', dataset_path='/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/data/ShareGPT_V3_unfiltered_cleaned_split.json', model='/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/models/llama/llama-2-13b', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=2000, logprobs=None, request_rate=inf, seed=0, trust_remote_code=False, disable_tqdm=True, save_result=True, metadata=None, result_dir='benchmarks/definitive_results/background/llama-2-13b/_8_', result_filename=None, ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', launch_server=True, server_args='--disable-log-requests --model=/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/models/llama/llama-2-13b --max-model-len=2048 --max-num-seqs=8', multiple_servers=1, launch_server_with_nsight=False, disable_log_stats=False, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=1.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None)
Servers started
Requests to servers. Values: ['http://localhost:28499/v1/completions']. Counts: [2000]
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
============ Serving Benchmark Result ============
Successful requests:                     2000      
Benchmark duration (s):                  1766.52   
Total input tokens:                      225574    
Total generated tokens:                  637914    
Request throughput (req/s):              1.13      
Output token throughput (tok/s):         361.11    
Total Token throughput (tok/s):          488.81    
---------------Time to First Token----------------
Mean TTFT (ms):                          871272.63 
Median TTFT (ms):                        865240.90 
P99 TTFT (ms):                           1732249.44
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          21.82     
Median TPOT (ms):                        21.88     
P99 TPOT (ms):                           23.11     
---------------Inter-token Latency----------------
Mean ITL (ms):                           22.10     
Median ITL (ms):                         21.49     
P99 ITL (ms):                            33.70     
==================================================
Concurrent checkers terminated
Servers terminated